---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemActiveTopDirn2
source: html/8368244d-e0dc-034c-3664-c58c62bce305.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemActiveTopDirn2 Property

"Top Minor Direction"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemActiveTopDirn2 { get; }
```